STM32-SDR/STM32-SDR/STM32-SDR/externals/SM32F4-Discovery/STEmbeddedGUI/src/LcdDriver_ILI9320.c
__IO uint32_t LCDType = LCD_ILI9320;


//#if defined (USE_STM3210E_EVAL) || defined (USE_STM32100E_EVAL) || defined (USE_STM322xG_EVAL)
/**
 * @brief  Writes 1 word to the LCD RAM.
 * @param  RGB_Code: the pixel color in RGB mode (5-6-5).
 * @retval None
 */
void LCD_WriteRAMWord(uint16_t RGB_Code)
{
	LCD_WriteRAM_Prepare();
	LCD_WriteRAM(RGB_Code);
}
//#endif /* USE_STM3210E_EVAL */

/**
 * @brief  LCD_DrawColorBMP
 * @param  *ptrBitmap:   The pointer to the image
 * @param  Xpos_Init: The X axis position
 * @param  Ypos_Init: The Y axis position
 * @param  Height:    The Height of the image
 * @param  Width:     The Width of the image
 * @retval None
 */
void LCD_DrawColorBMP(uint8_t* ptrBitmap, uint16_t Xpos_Init, uint16_t Ypos_Init, uint16_t Height, uint16_t Width)
{
#if 0
	uint32_t uDataAddr = 0, uBmpSize = 0;
	uint16_t uBmpData = 0;

	BmpBuffer32BitRead(&uBmpSize, ptrBitmap + 2);
	BmpBuffer32BitRead(&uDataAddr, ptrBitmap + 10);

	if (LCD_Direction == _0_degree) {
		GL_SetDisplayWindow(Xpos_Init, Ypos_Init, Height, Width);
		/* Set GRAM write direction and BGR = 1 */
		/* I/D=00 (Horizontal : decrement, Vertical : decrement) */
		/* AM=1 (address is updated in vertical writing direction) */
		LCD_WriteReg(R3, MAKE_R3_CMD(0x1008));
	}
	else if (LCD_Direction == _90_degree) {
		GL_SetDisplayWindow(Xpos_Init + Width - 1, Ypos_Init, Width, Height);
		/* Set GRAM write direction and BGR = 1 */
		/* I/D=01 (Horizontal : increment, Vertical : decrement) */
		/* AM=0 (address is updated in horizontal writing direction) */
		LCD_WriteReg(R3, MAKE_R3_CMD(0x1010));
	}
	else if (LCD_Direction == _180_degree) {
		GL_SetDisplayWindow(Xpos_Init + Height - 1, Ypos_Init + Width - 1, Height, Width);
		/* Set GRAM write direction and BGR = 1 */
		/* I/D=11 (Horizontal : increment, Vertical : increment) */
		/* AM=1 (address is updated in vertical writing direction) */
		LCD_WriteReg(R3, MAKE_R3_CMD(0x1038));
	}
	else if (LCD_Direction == _270_degree) {
		GL_SetDisplayWindow(Xpos_Init, Ypos_Init + Height - 1, Width, Height);
		/* Set GRAM write direction and BGR = 1 */
		/* I/D=10 (Horizontal : decrement, Vertical : increment) */
		/* AM=0 (address is updated in horizontal writing direction) */
		LCD_WriteReg(R3, MAKE_R3_CMD(0x1020));
	}

	LCD_SetCursor(Xpos_Init, Ypos_Init);

	if ((LCDType == LCD_ILI9320) || (LCDType == LCD_SPFD5408)) {
		/* Prepare to write GRAM */
		LCD_WriteRAM_Prepare();
	}

	/* Read bitmap data and write them to LCD */
	for (; uDataAddr < uBmpSize; uDataAddr += 2) {
		uBmpData = (uint16_t) (*(ptrBitmap + uDataAddr)) + (uint16_t) ((*(ptrBitmap + uDataAddr + 1)) << 8);
		LCD_WriteRAM(uBmpData);
	}
	if ((LCDType == LCD_ILI9320) || (LCDType == LCD_SPFD5408)) {
		if (pLcdHwParam.LCD_Connection_Mode == GL_SPI) {
			GL_LCD_CtrlLinesWrite(pLcdHwParam.LCD_Ctrl_Port_NCS, pLcdHwParam.LCD_Ctrl_Pin_NCS, GL_HIGH);
		}
	}
	LCD_Change_Direction(LCD_Direction);
	GL_SetDisplayWindow(LCD_Width - 1, LCD_Height - 1, LCD_Height, LCD_Width);
#endif
}




//////////////////////////////////////////////////////////////////////////////////////////////////////
//
//
//		From TFT_Display.c
//
//
//////////////////////////////////////////////////////////////////////////////////////////////////////



// ***********************************************************************************
// Register access routines
// ***********************************************************************************
void LCD_WriteReg(uint8_t LCD_Reg, uint16_t LCD_RegValue)
{
	LCD_REG = LCD_Reg;
	LCD_RAM = LCD_RegValue;
}
void LCD_WriteRAM_Prepare(void)
{
	LCD_REG = 0x22;
}
void LCD_WriteRAM_PrepareDir(LCD_WriteRAM_Direction direction)
{
	uint16_t r3Cmd = 0;

	switch (direction) {
	case LCD_WriteRAMDir_Right:
		/* Set GRAM write direction and BGR = 1 */
		/* I/D=00 (Horizontal : increment, Vertical : increment) */
		/* AM=1 (address is updated in horizontal writing direction) */
		//		r3Cmd = MAKE_R3_CMD(0x1030);
		r3Cmd = BUILD_R3_CMD(R3_INCRCEMENT, R3_INCRCEMENT, R3_CHANGEADDR_X);
		break;
	case LCD_WriteRAMDir_Left:
		/* Set GRAM write direction and BGR = 1 */
		/* I/D=01 (Horizontal : decrement, Vertical : increment) */
		/* AM=0 (address is updated in horizontal writing direction) */
		//		r3Cmd = MAKE_R3_CMD(0x1020);
		r3Cmd = BUILD_R3_CMD(R3_DECREMENT, R3_INCRCEMENT, R3_CHANGEADDR_X);
		break;
	case LCD_WriteRAMDir_Up:
		/* Set GRAM write direction and BGR = 1 */
		/* I/D=00 (Horizontal : increment, Vertical : decrement) */
		/* AM=1 (address is updated in vertical writing direction) */
		//		r3Cmd = MAKE_R3_CMD(0x1018);
		r3Cmd = BUILD_R3_CMD(R3_INCRCEMENT, R3_DECREMENT, R3_CHANGEADDR_Y);
		break;
	case LCD_WriteRAMDir_Down:
		/* Set GRAM write direction and BGR = 1 */
		/* I/D=00 (Horizontal : increment, Vertical : increment) */
		/* AM=1 (address is updated in vertical writing direction) */
		//		r3Cmd = MAKE_R3_CMD(0x1038);
		r3Cmd = BUILD_R3_CMD(R3_INCRCEMENT, R3_INCRCEMENT, R3_CHANGEADDR_Y);
		break;
	default:
		assert(0);
	}
	LCD_WriteReg(R3, r3Cmd);

	LCD_WriteRAM_Prepare();
}
void LCD_WriteRAM(uint16_t RGB_Code)
{
	LCD_RAM = RGB_Code;

	// TODO: Why is this delay needed? Without it, nothing appears on LCD!??
	extern void TFT_Delay(uint32_t nTime);
	//	TFT_Delay(50);
	TFT_Delay(10);
}



uint16_t LCD_ReadReg(uint8_t LCD_Reg)
{
	// TODO: Not sure if this works; copied from a different file (stm32100e_eval_lcd.c).
	/* Write 16-bit Index (then Read Reg) */
	LCD_REG = LCD_Reg;
	/* Read 16-bit Reg */
	uint16_t regValue = LCD_RAM;
	regValue = LCD_RAM;
	regValue = LCD_RAM;
	return regValue;
}
uint16_t LCD_ReadRAM(void)
{
    return LCD_ReadReg(R34);
}

// ***********************************************************************************
// Register access routines
// ***********************************************************************************
/**
 * @brief  Sets a display window used for RAM writes. When calling this function to restrict
 *         the write window from within a function, that function should also re-call this
 *         function to reset the write-window back to the full screen.
 * @param  x: specifies the X top left corner.
 * @param  y: specifies the Y top left corner.
 * @param  height: display window height.
 * @param  width: display window width.
 * @retval None
 */
void LCD_SetDisplayWindow(uint16_t x, uint16_t y, uint16_t height, uint16_t width)
{
	uint16_t rotatedY1 = LCD_ROTATE_GETY(x, y);
	uint16_t rotatedY2 = LCD_ROTATE_GETY(x + width - 1, y + height - 1);
	uint16_t rotatedX1 = LCD_ROTATE_GETX(x, y);
	uint16_t rotatedX2 = LCD_ROTATE_GETX(x + width - 1, y + height - 1);

	#define MAX(a, b) ((a)>(b)?(a):(b))
	#define MIN(a, b) ((a)<(b)?(a):(b))

